---
kind: other
id: Methods.T:Autodesk.Revit.DB.VertexIndexPairArray
source: html/6d2e253c-2fcb-a6a1-d581-67941cb2d3e4.htm
---
# VertexIndexPairArray Methods

Removes every VertexIndex pair from the array, rendering it empty.